app/controllers/blog_post_comments_controller.rb

SELECT "blog_post_comments".* FROM "blog_post_comments"
---
  def index
    @blog_post_comments = BlogPostComment.all