app/controllers/blog_posts_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
INSERT INTO "blog_posts" ("image_url", "title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["image_url", ""], ["title", "banana"], ["content", ""], ["user_id", 18], ["created_at", "2020-04-14 17:37:40.848865"], ["updated_at", "2020-04-14 17:37:40.848865"]]
---
  def create_by_user
    user = User.find(params[:user_id])
    blog_post = user.blog_posts.new(blog_post_params)
    if blog_post.save

UPDATE "blog_posts" SET "image_url" = $1, "updated_at" = $2 WHERE "blog_posts"."id" = $3  [["image_url", "https://miro.medium.com/max/1200/1*mk1-6aYaf_Bes1E3Imhc0A.jpeg"], ["updated_at", "2020-04-14 17:37:48.396601"], ["id", 4]]
---
  def update
    if @blog_post.update(blog_post_params)

SELECT "blog_post_comments".* FROM "blog_post_comments" WHERE "blog_post_comments"."blog_post_id" = $1  [["blog_post_id", 4]]
---
  def add_blog_post_comment
    @blog_post_comment = BlogPostComment.find(params[:blog_post_comment_id])