app/controllers/news_articles_controller.rb

  def index
    @news_articles = NewsArticle.all
---
SELECT "news_articles".* FROM "news_articles"

  def create_by_user
    user = User.find(params[:user_id])
    news_article = user.news_articles.new(news_article_params)
    if news_article.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
INSERT INTO "news_articles" ("image_url", "title", "article_url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @news_article.update(news_article_params)
---
UPDATE "news_articles" SET "title" = $1, "updated_at" = $2 WHERE "news_articles"."id" = $3  [["title", "Music Takes 12 Minutes to ‘Release Sadness’ and 9 to Make You Happy, Says New Study"], ["updated_at", "2020-04-14 02:43:41.150402"], ["id", 3]]

  def destroy
    @news_article.destroy
---
DELETE FROM "news_articles" WHERE "news_articles"."id" = $1  [["id", 8]]

  def add_news_article_comment
    @news_article_comment = NewsArticleComment.find(params[:news_article_comment_id])
---
SELECT "news_article_comments".* FROM "news_article_comments" WHERE "news_article_comments"."news_article_id" = $1  [["news_article_id", 5]]

    def set_news_article
      @news_article = NewsArticle.find(params[:id])
---
SELECT "news_articles".* FROM "news_articles" WHERE "news_articles"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]