app/controllers/news_article_comments_controller.rb

SELECT "news_article_comments".* FROM "news_article_comments"
---
  def index
    @news_article_comments = NewsArticleComment.all

INSERT INTO "news_article_comments" ("content", "user_id", "news_article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "hhffh"], ["user_id", 19], ["news_article_id", 3], ["created_at", "2020-04-14 18:20:16.058501"], ["updated_at", "2020-04-14 18:20:16.058501"]]
---
  def create
    @news_article_comment = @current_user.news_article_comments.new(news_article_comment_params)

    if @news_article_comment.save

SELECT "news_article_comments".* FROM "news_article_comments" WHERE "news_article_comments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def set_news_article_comment
      @news_article_comment = NewsArticleComment.find(params[:id])